@echo off
chcp 65001 > nul
:: Проверка прав администратора
net session >nul 2>&1
if %errorLevel% neq 0 (
    echo Пожалуйста, запустите этот файл от Имени Администратора!
    pause
    exit /b
)

echo [1/4] Загрузка оверклокерского драйвера в память ядра...
cd /d "C:\BW"
kdu.exe -dse 0

echo.
echo [2/4] Запуск графической программы разгона...
echo НАСТРОЙТЕ ЧАСТОТЫ И МОЩНОСТЬ В ИНТЕРФЕЙСЕ.
echo ПОСЛЕ ТОГО КАК ПРИМЕНИТЕ НАСТРОЙКИ, ПРОСТО ЗАКРОЙТЕ ПРОГРАММУ РАЗГОНА.
echo.

:: Запуск программы и ОЖИДАНИЕ её закрытия (ключ /wait)
start /wait NvpwrControl.exe

echo.
echo [3/4] Программа закрыта. Начинается выгрузка драйвера...
:: Если драйвер поддерживает штатную выгрузку как служба:
sc stop BlackwellDriver >nul 2>&1
sc delete BlackwellDriver >nul 2>&1
kdu.exe -dse 6

:: Очистка кэша и следов...
echo [4/4] Память очищена. Система готова к запуску игры.
echo Можно запускать античит.
timeout /t 10
